export const fields = [
    {
        id: "name",
        type: "text",
        placeholder: "Укажите как к вам обращаться",
        required: true,
        pattern: ".+",
        text: "Ваше имя",
        question: false
    },
    {
        id: "sms",
        type: "tel",
        placeholder: "37529*******",
        required: true,
        pattern: "\\d{9,13}",
        question: true,
        text: "Номер телефона без знака +"
    }
];


export const measurementsSectors = [
    {
        "id": "trouse",
        "text": "Обязательные мерки для трусиков",        
    },
    {
        "id": "trousePlus",
        "text": "Дополнительные мерки для трусиков"
    },
    {
        "id": "bra",
        "text": "Мерки для бюстгалтера"
    },
    {
        "id": "others",
        "text": "Остальные мерки"
    }   
]


export const measurements = {
    "trouse": {
        "Ot": "ОБХВАТ ТАЛИИ",
        "Ob": "ОБХВАТ БЕДЕР",
        "Vs": "ВЫСОТА СИДЕНИЯ"
    },
    "trousePlus": {
        "Obverh": "ОБХВАТ БЕДЕР ВЕРХНИЙ",
        "Vb": "ВЫСОТА БЕДРА"
    },
    "bra": {
        "Og": "ОБХВАТ ГРУДИ",
        "Opg": "ОБХВАТ ПОД ГРУДЬЮ",
        "Ong": "ОБХВАТ НАД ГРУДЬЮ",
        "Cg": "ЦЕНТР ГРУДИ",
    },
    "others": {
        "Os": "ОБХВАТ ШЕИ",
        "Sg": "ШИРИНА ГРУДИ",
        "Ss": "ШИРИНА СПИНЫ",
        "Sp": "ШИРИНА ПЛЕЧА",
        "Vg1": "ВЫСОТА ГРУДИ ПЕРВАЯ",
        "Dtp1": "ДЛИНА ТАЛИИ ПЕРЕДА ПЕРВАЯ",
        "Vg2": "ВЫСОТА ГРУДИ ВТОРАЯ",
        "Dtp2": "ДЛИНА ТАЛИИ ПЕРЕДА ВТОРАЯ",
        "Dts": "ДЛИНА ТАЛИИ СПИНКИ",
        "Dprz": "ВЫСОТА ПРОЙМЫ СЗАДИ",
        "Di": "ДЛИНА ИЗДЕЛИЯ",
        "Vb": "ВЫСОТА БЕДРА",
        "Op": "ОБХВАТ ПЛЕЧА",
        "Dr": "ДЛИНА РУКИ",
        "Vk": "ВЫСОТА КОЛЕНА",
        "D4p": "ДУГА ЧЕРЕЗ ПАХОВУЮ ОБЛАСТЬ",
        "Dsz": "ДЛИНА СЗАДИ",
        "Dbr": "ДЛИНА БРЮК",
        "Ozap": "ОБХВАТ ЗАПЯСТЬЯ"
    }
}